# Pandas library

![asd](index.png)

To use pandas, you'll typically start with the following line of code.

In [5]:
import pandas as pd

There are two core objects in pandas: the DataFrame and the Series.
DataFrame
### DataFrame
A DataFrame is a table. It contains an array of individual entries, each of which has a certain value. Each entry corresponds to a row (or record) and a column.

For example, consider the following simple DataFrame:

In [4]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In this example, the "0, No" entry has the value of 131. The "0, Yes" entry has a value of 50, and so on.

DataFrame entries are not limited to integers. For instance, here's a DataFrame whose values are strings:

In [6]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

We are using the pd.DataFrame() constructor to generate these DataFrame objects. The syntax for declaring a new one is a dictionary whose keys are the column names (Bob and Sue in this example), and whose values are a list of entries. This is the standard way of constructing a new DataFrame, and the one you are most likely to encounter.

The list of row labels used in a DataFrame is known as an Index. We can assign values to it by using an index parameter in our constructor:

In [9]:
pd.DataFrame({'reza': ['I liked it.', 'It was awful.'], 
              'amir': ['Pretty good.', 'Bland.']},
             index=['orange', 'Apple'])

                 reza          amir
orange    I liked it.  Pretty good.
Apple   It was awful.        Bland.


### Series

A Series, by contrast, is a sequence of data values. If a DataFrame is a table, a Series is a list. And in fact you can create one with nothing more than a list:

In [11]:
import numpy as np
pd.Series([1, 1, 3, 4, 5])

0    1
1    1
2    3
3    4
4    5
dtype: int64

### Reading data files
Data can be stored in any of a number of different forms and formats. By far the most basic of these is the humble CSV file. 
Let's now set aside our toy datasets and see what a real dataset looks like when we read it into a DataFrame. We'll use the pd.read_csv() function to read the data into a DataFrame. This goes thusly:

In [12]:
event = pd.read_csv("event.csv")

In [13]:
#We can use the shape attribute to check how large the resulting DataFrame is:
event.shape

(1083071, 8)

In [15]:
#We can examine the contents of the resultant DataFrame using the head() command, which grabs the first five rows:
event.head(10)

   displayId      timestamp   pageId  widgetId   userId  device  OS  browser
0    4706262  1578429005696  3543873      6262  2688642       0   0        0
1    4706267  1578429007726  6245475       607  2688641       1   3        0
2    4706260  1578429012060  4416499     11458  2688638       0   0        1
3    4706255  1578429017218  6246028      9358  1962852       0   0        0
4    4706256  1578429021388  5327047      9358  2687719       0   0        0
5    4706235  1578429023501  6245689      9358  2688634       0   0        0
6    4706181  1578429029640    83625      5802  2688629       0   0        5
7    4706228  1578429035793  4096624     11458   745082       1   1        4
8    4706234  1578429036317  6244430      7691  2688626       0   0        0
9    4706237  1578429039027  6246028      9358   804452       1   1        0

### Naive accessors

In Python, we can access the property of an object by accessing it as an attribute. A book object, for example, might have a title property, which we can access by calling book.title. Columns in a pandas DataFrame work in much the same way.

In [16]:
event.displayId

0          4706262
1          4706267
2          4706260
3          4706255
4          4706256
            ...
1083066     243935
1083067     243775
1083068     243745
1083069     243931
1083070     243751
Name: displayId, Length: 1083071, dtype: int64

In [17]:
event['displayId']

0          4706262
1          4706267
2          4706260
3          4706255
4          4706256
            ...
1083066     243935
1083067     243775
1083068     243745
1083069     243931
1083070     243751
Name: displayId, Length: 1083071, dtype: int64

indexing operator [ ] does have the advantage that it can handle column names with reserved characters in them (e.g. if we had a country providence column, reviews.country providence wouldn't work).

Doesn't a pandas Series look kind of like a fancy dictionary? It pretty much is, so it's no surprise that, to drill down to a single specific value, we need only use the indexing operator [ ] once more:

In [18]:
event['timestamp'][1]

1578429007726

### Indexing in pandas
The indexing operator and attribute selection are nice because they work just like they do in the rest of the Python ecosystem. As a novice, this makes them easy to pick up and use. However, pandas has its own accessor operators, loc and iloc

#### Index-based selection
Pandas indexing works in one of two paradigms. The first is index-based selection: selecting data based on its numerical position in the data. iloc follows this paradigm.

To select the first row of data in a DataFrame, we may use the following:

In [19]:
event.iloc[0]

displayId          4706262
timestamp    1578429005696
pageId             3543873
widgetId              6262
userId             2688642
device                   0
OS                       0
browser                  0
Name: 0, dtype: int64

Both loc and iloc are row-first, column-second. This is the opposite of what we do in native Python, which is column-first, row-second.
To get a column with iloc, we can do the following:

In [20]:
event.iloc[:, 0]

0          4706262
1          4706267
2          4706260
3          4706255
4          4706256
            ...
1083066     243935
1083067     243775
1083068     243745
1083069     243931
1083070     243751
Name: displayId, Length: 1083071, dtype: int64

to select just the second and third entries, we would do:

In [21]:
event.iloc[1:3, 0]

1    4706267
2    4706260
Name: displayId, dtype: int64



It's also possible to pass a list:

In [22]:
event.iloc[[0, 1, 2], 0]

0    4706262
1    4706267
2    4706260
Name: displayId, dtype: int64

#### Label-based selection
The second paradigm for attribute selection is the one followed by the loc operator: label-based selection. In this paradigm, it's the data index value, not its position, which matters.

For example, to get the first entry in reviews, we would now do the following:

In [23]:
event.loc[1, 'OS']

3

`iloc` is conceptually simpler than `loc` because it ignores the dataset's indices. When we use `iloc` we treat the dataset like a big matrix (a list of lists), one that we have to index into by position. `loc`, by contrast, uses the information in the indices to do its work. Since your dataset usually has meaningful indices, it's usually easier to do things using `loc` instead. For example, here's one operation that's much easier using `loc`:

In [24]:
event.loc[:, ['OS', 'timestamp', 'browser']]

         OS      timestamp  browser
0         0  1578429005696        0
1         3  1578429007726        0
2         0  1578429012060        1
3         0  1578429017218        0
4         0  1578429021388        0
...      ..            ...      ...
1083066   0  1579984124711        0
1083067   0  1579984124711        0
1083068   0  1579984124711        0
1083069   0  1579984145239        0
1083070   0  1579984161010        0

[1083071 rows x 3 columns]


### Manipulating the index

Label-based selection derives its power from the labels in the index. Critically, the index we use is not immutable. We can manipulate the index in any way we see fit.

The set_index() method can be used to do the job. Here is what happens when we set_index to the title field:

In [25]:
event.set_index("userId")

         displayId      timestamp    pageId  widgetId  device  OS  browser
userId
2688642    4706262  1578429005696   3543873      6262       0   0        0
2688641    4706267  1578429007726   6245475       607       1   3        0
2688638    4706260  1578429012060   4416499     11458       0   0        1
1962852    4706255  1578429017218   6246028      9358       0   0        0
2687719    4706256  1578429021388   5327047      9358       0   0        0
...            ...            ...       ...       ...     ...  ..      ...
44          243935  1579984124711    104462     12551       0   0        0
44          243775  1579984124711    104462     12551       0   0        0
44          243745  1579984124711    104462     12551       0   0        0
30          243931  1579984145239  10506468      6951       0   0        0
22          243751  1579984161010  10404661     12676       0   0        0

[1083071 rows x 7 columns]


### Conditional selection

So far we've been indexing various strides of data, using structural properties of the DataFrame itself. To do interesting things with the data, however, we often need to ask questions based on conditions.

For example, suppose that we're interested specifically in a OS in table:

In [26]:
event.OS==1

0          False
1          False
2          False
3          False
4          False
           ...
1083066    False
1083067    False
1083068    False
1083069    False
1083070    False
Name: OS, Length: 1083071, dtype: bool


This operation produced a Series of True/False booleans based on the country of each record. This result can then be used inside of loc to select the relevant data:

In [27]:
event.loc[event['OS']==1]

,displayId,timestamp,pageId,widgetId,userId,device,OS,browser
7,4706228,1578429035793,4096624,11458,745082,1,1,4
9,4706237,1578429039027,6246028,9358,804452,1,1,0
13,4706180,1578429060680,4096624,13208,2688484,1,1,0
21,4706146,1578429099618,5213595,11401,2688589,1,1,4
53,4706009,1578429219143,9473,3452,2688516,1,1,0
...,...,...,...,...,...,...,...,...
1083045,244067,1579983956562,10561141,4153,140,1,1,0
1083046,244064,1579983956562,10561141,4153,140,1,1,0
1083047,244009,1579983968393,10495653,12776,130,1,1,0
1083050,244040,1579983977599,10559277,6541,126,1,1,7
1083060,243753,1579984071458,10423218,6951,70,1,1,0

We can use the ampersand (&) to bring the two questions together:

In [28]:
event.loc[(event['OS']==1) & (event['browser']==4)]

,displayId,timestamp,pageId,widgetId,userId,device,OS,browser
7,4706228,1578429035793,4096624,11458,745082,1,1,4
21,4706146,1578429099618,5213595,11401,2688589,1,1,4
63,4705967,1578429261182,431634,10527,2688487,1,1,4
66,4705964,1578429276068,5420481,14195,2688480,1,1,4
101,4705788,1578429426829,116001,3452,2688377,1,1,4
...,...,...,...,...,...,...,...,...
1082905,244766,1579983148106,5590709,3452,705,1,1,4
1082917,244659,1579983246516,10530536,10933,625,1,1,4
1082993,244318,1579983621456,10494810,3637,341,1,1,4
1082998,244299,1579983645649,4340834,3452,332,1,1,4
1083040,244079,1579983941084,4258444,1422,151,1,1,4


Pandas comes with a few built-in conditional selectors, two of which we will highlight here.

The first is isin. isin is lets you select data whose value "is in" a list of values. For example, here's how we can use it to select event only with 0 or 4 browser:

In [33]:
len(event.loc[event.browser==4])

104810

### Summary functions
Pandas provides many simple "summary functions" (not an official name) which restructure the data in some useful way. For example, consider the describe() method:

In [34]:
event.OS.describe()

count    1.083071e+06
mean     3.605101e-01
std      6.267258e-01
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      1.000000e+00
max      7.000000e+00
Name: OS, dtype: float64



This method generates a high-level summary of the attributes of the given column. It is type-aware, meaning that its output changes based on the data type of the input. 



If you want to get some particular simple summary statistic about a column in a DataFrame or a Series, there is usually a helpful pandas function that makes it happen.

In [35]:
event.displayId.count()

1083071



To see a list of unique values we can use the unique() function:

In [38]:
len(event.userId.unique())

844374



To see a list of unique values and how often they occur in the dataset, we can use the value_counts() method:

In [43]:
event.userId.value_counts()

26033      323
163374     289
8409       279
80354      204
49622      161
          ...
2558571      1
2556522      1
2581094      1
2587237      1
2097152      1
Name: userId, Length: 844374, dtype: int64

In [ ]:
widgetId_mean = event.widgetId.mean()

def remean_points(row):
    row.widgetId = row.widgetId - widgetId_mean
    return row

event.apply(remean_points, axis=1)

Note that apply() return new, transformed Series and DataFrames, respectively. They don't modify the original data they're called on. If we look at the first row of reviews, we can see that it still has its original points value.

### Groupwise analysis

In [44]:
event.groupby('OS').OS.count()

OS
0    755570
1    280068
2     38343
3      5403
4      1137
5      2354
6       195
7         1
Name: OS, dtype: int64



groupby() created a group of reviews which allotted the same point values to the given event. Then, for each of these groups, we grabbed the points() column and counted how many times it appeared. value_counts() is just a shortcut to this groupby() operation.

We can use any of the summary functions we've used before with this data.

In [45]:
event.groupby('userId').timestamp.min()

userId
8          1578826853833
22         1579984161010
30         1579984145239
44         1579984124711
47         1579984089758
               ...
2688629    1578429029640
2688634    1578429023501
2688638    1578429012060
2688641    1578429007726
2688642    1578429005696
Name: timestamp, Length: 844374, dtype: int64

In [48]:
len(event.userId.unique())

844374

### Multi-indexes
In all of the examples we've seen thus far we've been working with DataFrame or Series objects with a single-label index. groupby() is slightly different in the fact that, depending on the operation we run, it will sometimes result in what is called a multi-index.

A multi-index differs from a regular index in that it has multiple levels. For example:

In [50]:
OS_reviewed = event.groupby(['OS', 'browser']).userId.agg([len, min])
OS_reviewed

               len      min
OS browser
0  0        582561        8
   1        114644       55
   3            59     2587
   4          8464      343
   5         27596      112
...            ...      ...
6  19           20    35942
   59            7   567730
   80            3   727055
   91            1  2367741
7  14            1   355635

[133 rows x 2 columns]

However, in general the multi-index method you will use most often is the one for converting back to a regular index, the reset_index() metho

In [51]:
OS = OS_reviewed.reset_index()
OS

     OS  browser     len      min
0     0        0  582561        8
1     0        1  114644       55
2     0        3      59     2587
3     0        4    8464      343
4     0        5   27596      112
..   ..      ...     ...      ...
128   6       19      20    35942
129   6       59       7   567730
130   6       80       3   727055
131   6       91       1  2367741
132   7       14       1   355635

[133 rows x 4 columns]

### Sorting
To get data in the order want it in we can sort it ourselves. The sort_values() method is handy for this.

In [52]:
OS.sort_values(by='len')

     OS  browser     len      min
132   7       14       1   355635
44    0       97       1  1671308
102   3        7       1   906108
42    0       83       1  2533133
41    0       79       1   647674
..   ..      ...     ...      ...
82    2        2   30182       48
47    1        4   95239      151
1     0        1  114644       55
45    1        0  160989       70
0     0        0  582561        8

[133 rows x 4 columns]

sort_values() defaults to an ascending sort, where the lowest values go first. However, most of the time we want a descending sort, where the higher numbers go first. That goes thusly:

In [53]:
OS.sort_values(by='len', ascending=False)

     OS  browser     len      min
0     0        0  582561        8
45    1        0  160989       70
1     0        1  114644       55
47    1        4   95239      151
82    2        2   30182       48
..   ..      ...     ...      ...
39    0       77       1   521415
41    0       79       1   647674
42    0       83       1  2533133
48    1        5       1  2194839
132   7       14       1   355635

[133 rows x 4 columns]



Finally, know that you can sort by more than one column at a time:

In [54]:
OS.sort_values(by=['browser', 'len'])

     OS  browser     len      min
107   4        0     813     3009
98    3        0    1520      383
110   5        0    1714     5571
81    2        0    4003      419
45    1        0  160989       70
..   ..      ...     ...      ...
78    1       95       1  1590838
44    0       97       1  1671308
79    1       99       1  2058292
97    2      102       1  2393270
80    1      102       2  2238678

[133 rows x 4 columns]